﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**        5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093         **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************

//<AMI_FHDR_START>
//----------------------------------------------------------------------------
//
// Name:        SecureBoot.UNI
//
// Description:    String definitions for Security Module
//
//----------------------------------------------------------------------------
//<AMI_FHDR_END>

/=#
//#include "VFR.uni"
#langdef   en-US "English"              // English
#langdef   x-AMI "x-AMI"                // temp. AMI Configuration Language

#string STR_EMPTY_STRING                #language en-US ""

#string STR_SECURE_BOOT_ENABLE          #language en-US  "Secure Boot"
#string STR_SECURE_BOOT_ENABLE          #language x-AMI  "SECB001"

#string STR_SECURE_BOOT_HELP            #language en-US  "Secure Boot can be enabled if 1.System running in User mode with enrolled Platform Key(PK) 2.CSM function is disabled"

#string SECURE_BOOT_MENU_FORM_TITLE     #language en-US  "Secure Boot menu"
#string SECURE_BOOT_MENU_FORM_HELP      #language en-US  "Customizable Secure Boot settings"

#string STR_SECURE_BOOT_MODE            #language en-US  "Secure Boot Mode"
#string STR_SECURE_BOOT_MODE            #language  x-AMI "SECB002"

#string SECURE_BOOT_STANDARD            #language en-US  "Standard"
#string SECURE_BOOT_CUSTOM              #language en-US  "Custom"
#string STR_SECURE_BOOT_MODE_HELP       #language en-US  "Secure Boot mode selector. 'Custom' Mode enables users to change Image Execution policy and manage Secure Boot Keys"

#string IMAGE_EXEC_POLICY_FORM_TITLE    #language en-US  "Image Execution Policy"
#string IMAGE_EXEC_POLICY_FORM_HELP     #language en-US  "Manage Image Execution Policy on Security Violation"

#string STR_VENDOR_KEYS_MODE            #language en-US  "Vendor Keys"

#string STR_LOAD_FROM_HELP              #language en-US "Image Execution Policy per device path on Security Violation"
#string STR_LOAD_FROM_FV                #language en-US "Internal FV"
#string STR_LOAD_FROM_FV                #language  x-AMI "SECB003"

#string STR_LOAD_FROM_OROM              #language en-US "Option ROM"
#string STR_LOAD_FROM_OROM              #language  x-AMI "SECB004"

#string STR_LOAD_FROM_REMOVABLE_MEDIA   #language en-US "Removable Media"
#string STR_LOAD_FROM_REMOVABLE_MEDIA   #language  x-AMI "SECB005"

#string STR_LOAD_FROM_FIXED_MEDIA       #language en-US "Fixed Media"
#string STR_LOAD_FROM_FIXED_MEDIA       #language  x-AMI "SECB006"

#string ALWAYS_ENABLED                  #language en-US  "Always Execute"
#string ALWAYS_DISABLED                 #language en-US  "Always Deny"
#string ALLOW_EXECUTE_ON_SECURITY_VIOLATION    #language en-US  "Allow Execute"
#string DEFER_EXECUTE_ON_SECURITY_VIOLATION    #language en-US  "Defer Execute"
#string DENY_EXECUTE_ON_SECURITY_VIOLATION     #language en-US  "Deny Execute"
#string QUERY_USER_ON_SECURITY_VIOLATION       #language en-US  "Query User"

#string STR_SECPLATFORM_FORM            #language en-US "Change default System Mode"
#string STR_RESET_INFO                  #language en-US "Reset is required for changes to take effect"
#string STR_SECPLATFORM_FORM_HELP       #language en-US "Update System Secure Boot settings"

#string STR_PLATFORM_MODE               #language en-US "System Mode"
#string STR_SETUP                       #language en-US "Setup"
#string STR_USER                        #language en-US "User"
#string STR_PLATFORM_SECURE_MODE        #language en-US "Secure Boot"
#string STR_ACTIVE                      #language en-US "Active"
#string STR_INACTIVE                    #language en-US "Not Active"

#string STR_CUSTOM_KEY                  #language en-US "Custom"
#string STR_ABSENT_KEY                  #language en-US " "
#string STR_DEFAULT_KEY                 #language en-US "Default"
#string STR_VENDOR_KEY                  #language en-US "Vendor"
#string STR_MIXED_KEY                   #language en-US "Mixed"

#string STR_DEFAULT_KEY_PROVISION_MODE  #language en-US "Provision Factory Default keys"
#string STR_DEFAULT_KEY_PROVISION_MODE  #language x-AMI "SECB008"

#string STR_KEY_PROVISION_MODE_HELP     #language en-US "Install factory default Secure Boot keys when System is in Setup Mode"

#string STR_KEY_MANAGEMENT_TITLE        #language en-US "Key Management"
#string STR_KEY_MANAGEMENT_HELP         #language en-US "Enables experienced users to modify Secure Boot variables"

#string STR_FORCE_SETUP_MODE            #language en-US "Delete all Secure Boot variables"
#string STR_GET_ALL_VARS                #language en-US "Save   all Secure Boot variables"
#string STR_FORCE_SETUP_MODE_HELP       #language en-US "Force System to Setup Mode - clear all Secure Boot Variables(PK,KEK,db,dbt,dbx). Change takes effect after reboot"
#string STR_FORCE_DEFAULT_MODE_HELP     #language en-US "Force System to User Mode - install all Factory Default keys(PK,KEK,db,dbt,dbx). Change takes effect after reboot"
#string STR_FORCE_DEFAULT_MODE          #language en-US "Enroll all Factory Default keys"

#string STR_FILE_SYSTEM                 #language en-US "Select a File system"
#string STR_FILE_SELECT                 #language en-US "Select File"

#string STR_GET_KEYS_HELP               #language en-US "Save NVRAM content of all Secure Boot variables to the files (EFI_SIGNATURE_LIST data format) in root folder on a target file system device"

#string STR_SECURE_SET                  #language en-US "Set New Key"
#string STR_SECURE_APPEND               #language en-US "Append  Key"
#string STR_SECURE_DELETE               #language en-US "Delete  key"
#string STR_KEY_UPDATE_HELP             #language en-US "Enroll Factory Defaults or load the keys from a file with:\n 1.Public Key Certificate in:\n  a)EFI_SIGNATURE_LIST\n  b)EFI_CERT_X509 (DER encoded)\n  c)EFI_CERT_RSA2048 (bin)\n  d)EFI_CERT_SHA256 (bin)\n 2.Authenticated UEFI Variable\n \nKey source:Default,Custom,Mixed\n(*) modified from Setup menu"

#string STR_KEY_TITLE                   #language en-US "Secure Boot variable |  Size| Key#| Key source"
#string STR_PK_TITLE                    #language en-US " "
#string STR_PK_TITLE_TEXT               #language en-US "Platform Key(PK)     "

#string STR_KEK_TITLE                   #language en-US " "
#string STR_KEK_TITLE_TEXT              #language en-US "Key Exchange Keys    "

#string STR_DB_TITLE                    #language en-US " "
#string STR_DB_TITLE_TEXT               #language en-US "Authorized Signatures"

#string STR_DBX_TITLE                   #language en-US " "
#string STR_DBX_TITLE_TEXT              #language en-US "Forbidden  Signatures"

#string STR_DBT_TITLE                   #language en-US " "
#string STR_DBT_TITLE_TEXT              #language en-US "Authorized TimeStamps"

#string STR_SECURE_FILE_TITLE           #language en-US "Input File Format"
#string STR_SECURE_VAR                  #language en-US "Authenticated Variable"
#string STR_SECURE_CER                  #language en-US "Public Key Certificate"
//#string STR_SECURE_EFI                  #language en-US "EFI PE/COFF image"

#string STR_ENABLE_ERROR_MODE_TITLE  #language en-US "Platform in Setup Mode!"
#string STR_ENABLE_ERROR_MODE        #language en-US "Secure Boot can be enabled when Platform is in User Mode. Repeat operation after enrolling Platform Key(PK)"
#string STR_CSM_LOAD_TITLE           #language en-US "WARNING: CSM is Loaded!"
#string STR_CSM_LOAD                 #language en-US "Disable the CSM in Setup. Repeat operation after Reboot to ensure UEFI Video (GOP) driver is operational"
#string STR_RESET_TO_SETUP           #language en-US "Deleting all variables will reset the\nPlatform to Setup Mode\nDo you want to proceed?"
#string STR_LOAD_DEFAULT_VARS_TITLE  #language en-US "Install factory defaults"
#string STR_LOAD_DEFAULT_VARS        #language en-US "Press 'Yes' to install factory default keys"
#string STR_VAR_UPDATE_LOCKED_TITLE  #language en-US "Secure Variable Update is locked down"
#string STR_VAR_UPDATE_LOCKED        #language en-US "Try again after System reboot"
#string STR_UPDATE_FROM_DEFAULTS     #language en-US "Press 'Yes' to load factory default '%s'\n or Select 'No' to load it from a\n file on external media"
#string STR_UPDATE_FROM_FILE         #language en-US "Confirm update of '%s' with content from the file '%s'"
#string STR_FAILED                   #language en-US "Failed"
#string STR_SUCCESS                  #language en-US "Success"
#string STR_WRITE_ERROR_TITLE        #language en-US "Error While Writing to a File"
#string STR_SAVE_SEC_KEY_TITLE       #language en-US "Save Security Key/Database"
#string STR_SAVE_SEC_KEY             #language en-US "%d variable(s) saved to disk"
#string STR_DELETE_SEC_KEY_TITLE     #language en-US "Delete Security Key/Database"
#string STR_PK_DEL_WARNING           #language en-US "WARNING: Removing 'PK' will reset the System to Setup Mode"
#string STR_DELETE_SEC_KEY           #language en-US "Confirm deletion of '%s' from NVRAM"
#string STR_NO_VALID_FS_TITLE        #language en-US "No Valid File System"
#string STR_NO_VALID_FS              #language en-US "No Valid File System Available"
#string STR_NO_VALID_FILE_TITLE      #language en-US "No Valid File"
#string STR_NO_VALID_FILE            #language en-US "No Valid File Available in the Selected File System"
//**********************************************************************
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**        5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093         **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
